use dmplat;

-- APP使用者
INSERT INTO user (user_name, user_account, user_password, born_date, gender, telephone, address, user_type, institution_id, create_time)
VALUES
("王大明", "123@abc.com.tw", "pbkdf2:sha256:600000$aSLbrxWbk4OfB4yS$7c6c7f4ba853a0fc02583d4521e49d8211655599b469e84432d8bfcadf7b0e44", "2023-08-01", "M", "0900123456", "台東市中山路1號", 1, 2,"2023-08-18 13:58:31"),
('陳小美', '456@abc.com.tw', 'pbkdf2:sha256:600000$hAko7XVEsjrpjNOo$f5231b11b3d2ebef3f1d70c3265ac3db70b0368b452bc874c6b231c540ae7e84', '2023-08-03', "F", '0900123456', '台東市更生一路22號', 1, 3,'2023-08-18 14:01:42'),
('張志勝', '789@abc.com.tw', 'pbkdf2:sha256:600000$RaTv0pBfyje8yDrW$080a529d18e8ba1913c488d4bd6a6afea1136cf5e3866dab95918f881711ef61', '2023-08-05', "M",'0900456789', '台東市南京路25號之一', 1, 3,'2023-08-18 14:12:10')
;

-- 醫療機構
INSERT INTO medical_institution (institution_name, institution_type, telephone, address, contact_person, create_time)
VALUES
("個管中心", 0, "089321520", "台東市和平一路3號5樓", "曾聰明", now()),
("台東市衛生所", 5, "089362192", "台東市大同路51號", "張東風", now()),
("台東診所", 4, "089321520", "台東市豐榮街2巷7號", "林明生", now())
;

-- 醫事人員
INSERT INTO medical_staff(staff_name, staff_account, staff_password, staff_position_code, staff_position, create_time)
VALUES
("曾聰明", "abc@dmp.com.tw", "rxWbk4OfB4yS$7c6c7f4ba853a0fc02583d45", 5, "執行長兼個管師", now()),
("郭涼秋", "def@dmp.com.tw", "rxWbkhAko7XVEsjrpjNOo$f52d0fc02583d45", 6, "衛教師", now()),
("張東風", "hij@taitung.org.tw", "aSLbrxWbk4OfB4yS$7c6c7f4ba853a0fss", 1, "醫師", now()),
("賴曉鈴", "klm@taitung.org.tw", "aSLsddw4Of80a529d18e8ba19a853a0fss", 2, "護理師", now()),
("林明生", "nop@doc.com.tw", "b11b3d2ebef3f1d70c3265ac3d7ba853a0fss", 1, "醫師", now())
;

-- 醫療機構與人員關聯
INSERT INTO institution_staff_relate(institution_id, staff_id, create_time)
VALUES
(1, 1, now()),
(1, 2, now()),
(2, 3, now()),
(2, 4, now()),
(2, 1, now()),
(2, 2, now()),
(3, 5, now()),
(3, 1, now()),
(3, 2, now())
;

-- 紀錄類型參數
INSERT INTO record_type (record_name, record_name_cn, record_unit, record_group, create_time)
VALUES
("HbA1C", "醣化血色素", "%", 1, now()),
("LDL-C", "低密度脂蛋白膽固醇", "mg/dL", 1, now()),
("Height", "身高", "cm", 1, now()),
("Weight", "體重", "kg", 1, now()),
("GlucoseAC", "飯前血糖", "mg/dL", 2, now()),
("GlucosePC", "飯後血糖", "mg/dL", 2, now()),
("DBP", "舒張壓", "mmHg", 2, now()),
("SBP", "收縮壓", "mmHg", 2, now())
;

-- 藥品資料
INSERT INTO medicine (medicine_name, medicine_dosage, create_time)
VALUES
("Euclidan tablets 50m", "BID", now()),
("Passton capsules", "TID", now()),
("Meptin tablets", "TID", now())
;

-- 處方紀錄關聯alter
INSERT INTO prescription_relate(prescription_id, medicine_id, create_time)
VALUES
(1, 1, now()),
(1, 2, now()),
(2, 2, now()),
(2, 3, now())
;

-- 回診追蹤階段參數
INSERT INTO phase_type (diseases_name, phase_code, phase_name, create_time)
VALUES
("DM", "P1407C", "初診", now()),
("DM", "P1408C1", "追蹤管理(第一次)", now()),
("DM", "P1408C2", "追蹤管理(第二次)", now()),
("DM", "P1408C3", "追蹤管理(第三次)", now()),
("DM", "P1409C", "年度評估", now())
;

-- 回診/就診紀錄
INSERT INTO medical_records(record_date, patient_id, institution_id, doctor_id, dietitian_id, educator_id, phase_type, prescription_id, diagnosis, memo, follow_up_date, create_time)
VALUES
("2023-08-18", 1, 2, 2, 2, 4, 1, 1, "Type 2 diabetes", "", "2023-11-20", now()),
("2023-08-20", 2, 3, 5, 2, 2, 1, 1, "Type 2 diabetes","", "2023-11-25", now()),
("2023-08-22", 3, 3, 5, 2, 2, 1, 1, "Type 1 diabetes","", "2023-11-28", now())
;

-- 回診檢驗數據
INSERT INTO medical_records_data(medical_record_id, record_type, record, test_date, create_time)
VALUES
(1, 1, 5.0, "2023-08-18", now()),
(1, 2, 90, "2023-08-18", now()),
(2, 1, 5.0, "2023-08-20", now()),
(2, 2, 90, "2023-08-20", now()),
(3, 1, 5.0, "2023-08-22", now()),
(3, 2, 90, "2023-08-22", now())
;

-- 自主監測資料
INSERT INTO self_health_data (patient_id, recorder_id, record_type, record_time, record, create_time)
VALUES
(1, 1, 1, "2023-08-18 18:00:00", 5.0, now()),
(1, 1, 2, "2023-08-18 18:00:00", 90, now()),
(1, 1, 3, "2023-08-18 18:00:00", 173, now()),
(1, 1, 4, "2023-08-18 18:00:00", 86, now()),
(1, 1, 5, "2023-08-18 18:00:00", 83, now()),
(1, 1, 6, "2023-08-18 18:00:00", 124, now()),
(1, 1, 7, "2023-08-18 18:00:00", 83, now()),
(1, 1, 8, "2023-08-18 18:00:00", 124, now()),
(2, 2, 1, "2023-08-18 18:00:00", 5.0, now()),
(2, 2, 2, "2023-08-18 18:00:00", 90, now()),
(2, 2, 3, "2023-08-18 18:00:00", 173, now()),
(2, 2, 4, "2023-08-18 18:00:00", 86, now()),
(2, 2, 5, "2023-08-18 18:00:00", 83, now()),
(2, 2, 6, "2023-08-18 18:00:00", 124, now()),
(2, 2, 7, "2023-08-18 18:00:00", 83, now()),
(2, 2, 8, "2023-08-18 18:00:00", 124, now()),
(3, 3, 1, "2023-08-18 18:00:00", 5.0, now()),
(3, 3, 2, "2023-08-18 18:00:00", 90, now()),
(3, 3, 3, "2023-08-18 18:00:00", 173, now()),
(3, 3, 4, "2023-08-18 18:00:00", 86, now()),
(3, 3, 5, "2023-08-18 18:00:00", 83, now()),
(3, 3, 6, "2023-08-18 18:00:00", 124, now()),
(3, 3, 7, "2023-08-18 18:00:00", 83, now()),
(3, 3, 8, "2023-08-18 18:00:00", 124, now()),
(1, 1, 1, "2023-08-19 12:00:00", 5.0, now()),
(1, 1, 2, "2023-08-19 12:00:00", 90, now()),
(1, 1, 3, "2023-08-19 12:00:00", 173, now()),
(1, 1, 4, "2023-08-19 12:00:00", 86, now()),
(1, 1, 5, "2023-08-19 12:00:00", 83, now()),
(1, 1, 6, "2023-08-19 12:00:00", 124, now()),
(1, 1, 7, "2023-08-19 12:00:00", 83, now()),
(1, 1, 8, "2023-08-19 12:00:00", 124, now()),
(2, 2, 1, "2023-08-19 12:00:00", 5.0, now()),
(2, 2, 2, "2023-08-19 12:00:00", 90, now()),
(2, 2, 3, "2023-08-19 12:00:00", 173, now()),
(2, 2, 4, "2023-08-19 12:00:00", 86, now()),
(2, 2, 5, "2023-08-19 12:00:00", 83, now()),
(2, 2, 6, "2023-08-19 12:00:00", 124, now()),
(2, 2, 7, "2023-08-19 12:00:00", 83, now()),
(2, 2, 8, "2023-08-19 12:00:00", 124, now()),
(3, 3, 1, "2023-08-19 12:00:00", 5.0, now()),
(3, 3, 2, "2023-08-19 12:00:00", 90, now()),
(3, 3, 3, "2023-08-19 12:00:00", 173, now()),
(3, 3, 4, "2023-08-19 12:00:00", 86, now()),
(3, 3, 5, "2023-08-19 12:00:00", 83, now()),
(3, 3, 6, "2023-08-19 12:00:00", 124, now()),
(3, 3, 7, "2023-08-19 12:00:00", 83, now()),
(3, 3, 8, "2023-08-19 12:00:00", 124, now()),
(1, 1, 1, "2023-08-20 08:00:00", 5.0, now()),
(1, 1, 2, "2023-08-20 08:00:00", 90, now()),
(1, 1, 3, "2023-08-20 08:00:00", 173, now()),
(1, 1, 4, "2023-08-20 08:00:00", 86, now()),
(1, 1, 5, "2023-08-20 08:00:00", 83, now()),
(1, 1, 6, "2023-08-20 08:00:00", 124, now()),
(1, 1, 7, "2023-08-20 08:00:00", 83, now()),
(1, 1, 8, "2023-08-20 08:00:00", 124, now()),
(2, 2, 1, "2023-08-20 08:00:00", 5.0, now()),
(2, 2, 2, "2023-08-20 08:00:00", 90, now()),
(2, 2, 3, "2023-08-20 08:00:00", 173, now()),
(2, 2, 4, "2023-08-20 08:00:00", 86, now()),
(2, 2, 5, "2023-08-20 08:00:00", 83, now()),
(2, 2, 6, "2023-08-20 08:00:00", 124, now()),
(2, 2, 7, "2023-08-20 08:00:00", 83, now()),
(2, 2, 8, "2023-08-20 08:00:00", 124, now()),
(3, 3, 1, "2023-08-20 08:00:00", 5.0, now()),
(3, 3, 2, "2023-08-20 08:00:00", 90, now()),
(3, 3, 3, "2023-08-20 08:00:00", 173, now()),
(3, 3, 4, "2023-08-20 08:00:00", 86, now()),
(3, 3, 5, "2023-08-20 08:00:00", 83, now()),
(3, 3, 6, "2023-08-20 08:00:00", 124, now()),
(3, 3, 7, "2023-08-20 08:00:00", 83, now()),
(3, 3, 8, "2023-08-20 08:00:00", 124, now()),
(1, 1, 1, "2023-09-01 18:00:00", 5.0, now()),
(1, 1, 2, "2023-09-01 18:00:00", 90, now()),
(1, 1, 3, "2023-09-01 18:00:00", 173, now()),
(1, 1, 4, "2023-09-01 18:00:00", 86, now()),
(1, 1, 5, "2023-09-01 18:00:00", 83, now()),
(1, 1, 6, "2023-09-01 18:00:00", 124, now()),
(1, 1, 7, "2023-09-01 18:00:00", 83, now()),
(1, 1, 8, "2023-09-01 18:00:00", 124, now())
;